fork/app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("creator_email", "res_id", "restaurant_name", "overall_rating", "price_rating", "food_quality", "comments", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @review = Review.new(review_params)

    if @review.save